emacs/Literative Configurations/evil.org
* Evil — the Dvorak HTNS blade
:PROPERTIES:
:PACKAGE:  evil
:STRAIGHT: (evil :type git :host github :repo "emacs-evil/evil")
:END:
** Evil Base Configuration :init:
#+begin_src emacs-lisp
(setq evil-want-keybinding nil
      evil-want-C-u-scroll t)
#+end_src
** Enable Evil Mode :config:
#+begin_src emacs-lisp
(evil-mode 1)
#+end_src
** Dvorak HTNS Movement :config:
#+begin_src emacs-lisp
;; ════════════════════════════════════════════════════════════
;; § DVORAK HTNS — DIRECTIONAL DISCIPLINE
;; ════════════════════════════════════════════════════════════
;; h = left, t = down, n = up, s = right
(define-key evil-normal-state-map (kbd "h") 'evil-backward-char)
(define-key evil-normal-state-map (kbd "t") 'evil-next-line)
(define-key evil-normal-state-map (kbd "n") 'evil-previous-line)
(define-key evil-normal-state-map (kbd "s") 'evil-forward-char)
(define-key evil-motion-state-map (kbd "h") 'evil-backward-char)
(define-key evil-motion-state-map (kbd "t") 'evil-next-line)
(define-key evil-motion-state-map (kbd "n") 'evil-previous-line)
(define-key evil-motion-state-map (kbd "s") 'evil-forward-char)

;; Visual state movement
(define-key evil-visual-state-map (kbd "h") 'evil-backward-char)
(define-key evil-visual-state-map (kbd "t") 'evil-next-line)
(define-key evil-visual-state-map (kbd "n") 'evil-previous-line)
(define-key evil-visual-state-map (kbd "s") 'evil-forward-char)

;; Keep standard Evil delete behavior (dd, dw, etc. still work)
;; The 'd' key works as an operator in normal mode by default
#+end_src
** Leader Key Setup :config:
#+begin_src emacs-lisp
;; ════════════════════════════════════════════════════════════
;; § LEADER KEY — SPACE AS COMMAND NEXUS
;; ════════════════════════════════════════════════════════════
(defvar shapeshifter-leader-map (make-sparse-keymap))
(define-key evil-normal-state-map (kbd "SPC") shapeshifter-leader-map)
(define-key evil-motion-state-map (kbd "SPC") shapeshifter-leader-map)
#+end_src
** Leader Bindings :config:
#+begin_src emacs-lisp
;; ════════════════════════════════════════════════════════════
;; § LEADER BINDINGS — CORE OPERATIONS
;; ════════════════════════════════════════════════════════════
(define-key shapeshifter-leader-map (kbd "f") #'find-file)
(define-key shapeshifter-leader-map (kbd "s") #'save-buffer)
(define-key shapeshifter-leader-map (kbd "g") #'magit-status)
(define-key shapeshifter-leader-map (kbd "b") #'switch-to-buffer)
(define-key shapeshifter-leader-map (kbd "k") #'kill-buffer)
(define-key shapeshifter-leader-map (kbd "j") #'avy-goto-char-timer)
;; Dired launcher
(define-key shapeshifter-leader-map (kbd "d") #'dired)
(define-key shapeshifter-leader-map (kbd "D") #'dired-jump) ; jump to current file's dir

;; Window navigation using SPC w prefix (standard evil convention)
(define-key shapeshifter-leader-map (kbd "w") (make-sparse-keymap))
(define-key shapeshifter-leader-map (kbd "wh") #'evil-window-left)
(define-key shapeshifter-leader-map (kbd "ws") #'evil-window-right)
(define-key shapeshifter-leader-map (kbd "wt") #'evil-window-down)
(define-key shapeshifter-leader-map (kbd "wn") #'evil-window-up)
(define-key shapeshifter-leader-map (kbd "ww") #'evil-window-next)
(define-key shapeshifter-leader-map (kbd "wv") #'evil-window-vsplit)
(define-key shapeshifter-leader-map (kbd "wx") #'evil-window-split)
(define-key shapeshifter-leader-map (kbd "wq") #'evil-window-delete)
#+end_src
** Org Mode Keybindings :config:
#+begin_src emacs-lisp
;; ════════════════════════════════════════════════════════════
;; § ORG MODE — STRUCTURAL NAVIGATION
;; ════════════════════════════════════════════════════════════
(with-eval-after-load 'org
  (evil-define-key 'normal org-mode-map
    (kbd "TAB")       #'org-cycle
    (kbd "<tab>")     #'org-cycle
    (kbd "<C-tab>")   #'org-shifttab
    (kbd "C-<tab>")   #'org-shifttab))
#+end_src
** Grease — Easy Launch :config:
#+begin_src emacs-lisp
;; ═══════════════════════════════════════
;; § GREASE — GLOBAL LAUNCHER
;; ═══════════════════════════════════════

;; Quick version: open directly in current buffer's directory
(defun shapeshifter/open-grease-here ()
  "Open Grease directly in the current buffer's directory."
  (interactive)
  (grease-open default-directory))

;; Prompt version: choose directory
(defun shapeshifter/open-grease-prompt ()
  "Prompt for a directory (default to current buffer) and open Grease there."
  (interactive)
  (let ((dir (read-directory-name "Open Grease in directory: " default-directory)))
    (grease-open dir)))

;; Bindings
(define-key shapeshifter-leader-map (kbd "x") #'shapeshifter/open-grease-here)
(define-key shapeshifter-leader-map (kbd "X") #'shapeshifter/open-grease-prompt)

#+end_src

** Grease — Easy Movement                                            :config:
#+begin_src emacs-lisp
;; ═══════════════════════════════════════
;; § GREASE — DVORAK-OPTIMIZED NAVIGATION & POWER
;; ═══════════════════════════════════════
(with-eval-after-load 'grease
  (evil-define-key 'normal grease-mode-map
    ;; ──────────────────────────────────────────────
    ;; Core Navigation (Dvorak HTNS)
    ;; ──────────────────────────────────────────────
    (kbd "h") #'grease-up-directory                     ; parent dir
    (kbd "s") #'grease-visit                             ; open file/dir
    (kbd "t") #'evil-next-line                           ; down
    (kbd "n") #'evil-previous-line                       ; up

    ;; ──────────────────────────────────────────────
    ;; Enhanced Actions
    ;; ──────────────────────────────────────────────
    (kbd "RET") #'grease-visit

    ;; ──────────────────────────────────────────────
    ;; Toggle / Misc Features
    ;; ──────────────────────────────────────────────
    (kbd ".") #'grease-toggle-hidden

    ;; ──────────────────────────────────────────────
    ;; Arrow keys
    ;; ──────────────────────────────────────────────
    (kbd "<left>") #'grease-up-directory
    (kbd "<right>") #'grease-visit
    (kbd "<up>") #'evil-previous-line
    (kbd "<down>") #'evil-next-line))

#+end_src

** Tab Bar — Echo-Area Cartography :config:
#+begin_src emacs-lisp
;; ════════════════════════════════════════════════════════════
;; § TAB BAR — ECHO-AREA CARTOGRAPHY
;; ════════════════════════════════════════════════════════════
(with-eval-after-load 'tab-bar-echo-area
;; Leader: SPC t …
(define-key shapeshifter-leader-map (kbd "t") (make-sparse-keymap))

;; SPC t c → echo current tab name
(define-key shapeshifter-leader-map (kbd "tc")
#'tab-bar-echo-area-print-tab-name)

;; SPC t p → echo all tab names
(define-key shapeshifter-leader-map (kbd "tp")
#'tab-bar-echo-area-print-tab-names))
#+end_src
** Dired — HTNS Movement & Leader Launch :config:
#+begin_src emacs-lisp
;; ════════════════════════════════════════════════════════════
;; § DIRED — DVORAK HTNS NAVIGATION
;; ════════════════════════════════════════════════════════════
(with-eval-after-load 'dired
  (evil-define-key 'normal dired-mode-map
    ;; ──────────────────────────────────────────────
    ;; Core Navigation (Dvorak HTNS)
    ;; ──────────────────────────────────────────────
    (kbd "h") #'dired-up-directory                      ; parent dir
    (kbd "t") #'evil-next-line                          ; down
    (kbd "n") #'evil-previous-line                      ; up
    (kbd "s") #'dired-find-file                         ; open file/enter dir
    
    ;; ──────────────────────────────────────────────
    ;; Space to open (alternative to 's')
    ;; ──────────────────────────────────────────────
    (kbd "SPC") #'dired-find-file
    
    ;; ──────────────────────────────────────────────
    ;; Keep standard Dired actions
    ;; ──────────────────────────────────────────────
    (kbd "RET") #'dired-find-file
    (kbd "d") #'dired-flag-file-deletion
    (kbd "x") #'dired-do-flagged-delete
    (kbd "m") #'dired-mark
    (kbd "u") #'dired-unmark
    (kbd "U") #'dired-unmark-all-marks
    (kbd "g") #'revert-buffer                           ; refresh
    (kbd "q") #'quit-window))                          ; close dired
#+end_src
* Annalist
:PROPERTIES:
:PACKAGE:  annalist
:STRAIGHT: (annalist :type git :host github :repo "noctuid/annalist.el")
:END:
** Initialize :config:
#+begin_src emacs-lisp
(require 'evil-collection)
(evil-collection-init)
#+end_src
* Evil Collection
:PROPERTIES:
:PACKAGE:  evil-collection
:STRAIGHT: (evil-collection :type git :host github :repo "emacs-evil/evil-collection")
:AFTER:    (evil annalist)
:END:
** Initialize :config:
#+begin_src emacs-lisp
(with-eval-after-load 'evil
  (when (require 'evil-collection nil t)
    (evil-collection-init)))
#+end_src
* Evil Surround
:PROPERTIES:
:PACKAGE:  evil-surround
:STRAIGHT: (evil-surround :type git :host github :repo "timcharper/evil-surround")
:AFTER:    evil
:END:
** Enable Globally :config:
#+begin_src emacs-lisp
(global-evil-surround-mode 1)
#+end_src
* Multiple Cursors
:PROPERTIES:
:PACKAGE:  multiple-cursors
:STRAIGHT: t
:AFTER:    evil
:END:
* Evil Nerd Commenter
:PROPERTIES:
:PACKAGE:  evil-nerd-commenter
:STRAIGHT: (evil-nerd-commenter :type git :host github :repo "redguardtoo/evil-nerd-commenter")
:AFTER:    evil
:END:
** Configuration :config:
#+begin_src emacs-lisp
(declare-function web-mode-comment-or-uncomment-region "web-mode")
(setq evilnc-comment-text-object "c")
(evilnc-default-hotkeys)
(define-key evil-normal-state-map (kbd "gc") #'evilnc-comment-or-uncomment-lines)
(define-key evil-visual-state-map (kbd "gc") #'evilnc-comment-or-uncomment-lines)
(define-key evil-normal-state-map (kbd "gC") #'evilnc-copy-and-comment-lines)
#+end_src
